# St7SetLSACombinationName

Sets the name of the specified linear load case combination for solver-generated .LSA files.

long St7SetLSACombinationName(long uID, long CaseNum, char* CaseName)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Load case combination number.

CaseName

Name of the specified load case combination.